# 120 metų Olimpiados istorijos (Vasaros ir Žiemos žaidynių)
Nuo 1896m. - 2016m.

In [2]:
import pandas as pd
import numpy as np

In [157]:
data = pd.read_csv('athlete_events.csv')
regions = pd.read_csv('noc_regions.csv')
df = pd.merge(data, regions, on='NOC', how='left')
df

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,region,notes
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,China,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,China,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,Denmark,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,Denmark,NaN
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,Netherlands,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN,Poland,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN,Poland,NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN,Poland,NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN,Poland,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN,Poland,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 271116 entries, 0 to 271115
Data columns (total 17 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
 15  region  270746 non-null  object
 16  notes   5039 non-null    object
dtypes: float64(3), int64(2), object(12)
memory usage: 37.2+ MB

In [6]:
total_rows = len(df.axes[0]) # Is viso eiluciu
print (total_rows)

271116

In [7]:
total_cols = len(df.axes[1]) # Is viso stulpeliu
print (total_cols)

17

In [8]:
df.ID.nunique(dropna = True) # Kiek is viso yra dalyvave

135571

In [9]:
df.Games.nunique(dropna = True) # Kartai kiek vyko Olimpines

51

In [10]:
df.City.nunique(dropna = True)

42

In [11]:
df.Sport.nunique(dropna = True)

66

In [12]:
df.Event.nunique(dropna = True)

765

In [13]:
df['Sex'].value_counts()

M    196594
F     74522
Name: Sex, dtype: int64

In [14]:
df['Medal'].value_counts()

Gold      13372
Bronze    13295
Silver    13116
Name: Medal, dtype: int64

# Pradedami valyti ir analizuoti duomenys

# Hipoteze
Ruosiuosi patikrinti hipoteze ar Moteru atleciu optimalus amzius - 23m.;ugis - 172cm;svoris - 66kg
                                 Vyru atletu optimalus amzius - 25m;ugis - 185cm; svoris - 78kg

In [158]:
df = df.rename( columns={'Sex': 'Gender'})

In [159]:
df = df.rename( columns={'region': 'Region'})

In [160]:
df = df.drop('notes', axis=1)

In [217]:
df.dropna(subset=['Age', 'Height', 'Weight', 'Medal'], inplace=True)
df

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
40,16,Juhamatti Tapio Aaltonen,M,28.0,184.0,85.0,Finland,FIN,2014 Winter,2014,Winter,Sochi,Ice Hockey,Ice Hockey Men's Ice Hockey,Bronze,Finland
41,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Individual All-Around,Bronze,Finland
42,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Team All-Around,Gold,Finland
44,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Horse Vault,Gold,Finland
48,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Pommelled Horse,Gold,Finland
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271078,135553,Galina Ivanovna Zybina (-Fyodorova),F,25.0,168.0,80.0,Soviet Union,URS,1956 Summer,1956,Summer,Melbourne,Athletics,Athletics Women's Shot Put,Silver,Russia
271080,135553,Galina Ivanovna Zybina (-Fyodorova),F,33.0,168.0,80.0,Soviet Union,URS,1964 Summer,1964,Summer,Tokyo,Athletics,Athletics Women's Shot Put,Bronze,Russia
271082,135554,Bogusaw Zych,M,28.0,182.0,82.0,Poland,POL,1980 Summer,1980,Summer,Moskva,Fencing,"Fencing Men's Foil, Team",Bronze,Poland
271102,135563,Olesya Nikolayevna Zykina,F,19.0,171.0,64.0,Russia,RUS,2000 Summer,2000,Summer,Sydney,Athletics,Athletics Women's 4 x 400 metres Relay,Bronze,Russia
271103,135563,Olesya Nikolayevna Zykina,F,23.0,171.0,64.0,Russia,RUS,2004 Summer,2004,Summer,Athina,Athletics,Athletics Women's 4 x 400 metres Relay,Silver,Russia

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30181 entries, 40 to 271103
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      30181 non-null  int64
 1   Name    30181 non-null  object
 2   Gender  30181 non-null  object
 3   Age     30181 non-null  float64
 4   Height  30181 non-null  float64
 5   Weight  30181 non-null  float64
 6   Team    30181 non-null  object
 7   NOC     30181 non-null  object
 8   Games   30181 non-null  object
 9   Year    30181 non-null  int64
 10  Season  30181 non-null  object
 11  City    30181 non-null  object
 12  Sport   30181 non-null  object
 13  Event   30181 non-null  object
 14  Medal   30181 non-null  object
 15  Region  30172 non-null  object
dtypes: float64(3), int64(2), object(11)
memory usage: 3.9+ MB

In [95]:
df.describe()

                  ID           Age        Height        Weight          Year
count   30181.000000  30181.000000  30181.000000  30181.000000  30181.000000
mean    70225.949604     25.429012    177.642358     73.753554   1988.005964
std     38839.720551      5.049684     10.924188     15.004992     22.718451
min        16.000000     13.000000    136.000000     28.000000   1896.000000
25%     37494.000000     22.000000    170.000000     63.000000   1976.000000
50%     69771.000000     25.000000    178.000000     73.000000   1992.000000
75%    104111.000000     28.000000    185.000000     83.000000   2006.000000
max    135563.000000     66.000000    223.000000    182.000000   2016.000000

In [96]:
df['Sport'].value_counts()

Athletics                    3648
Swimming                     2486
Rowing                       2104
Ice Hockey                   1301
Hockey                       1168
Gymnastics                   1161
Fencing                      1109
Football                     1084
Canoeing                     1041
Basketball                   1000
Wrestling                     967
Volleyball                    958
Handball                      937
Cycling                       845
Water Polo                    764
Boxing                        708
Cross Country Skiing          687
Sailing                       677
Equestrianism                 663
Shooting                      542
Weightlifting                 532
Judo                          526
Speed Skating                 488
Biathlon                      388
Alpine Skiing                 354
Baseball                      333
Diving                        318
Bobsleigh                     283
Short Track Speed Skating     274
Figure Skating                249
Synchronized Swimming         214
Archery                       206
Luge                          178
Ski Jumping                   175
Tennis                        173
Softball                      172
Table Tennis                  163
Badminton                     154
Modern Pentathlon             153
Taekwondo                     144
Nordic Combined               137
Curling                       131
Rhythmic Gymnastics           124
Freestyle Skiing              102
Snowboarding                   89
Rugby Sevens                   74
Beach Volleyball               68
Triathlon                      30
Rugby                          30
Trampolining                   29
Skeleton                       24
Tug-Of-War                      8
Golf                            4
Lacrosse                        2
Art Competitions                2
Name: Sport, dtype: int64

In [97]:
df['Event'].value_counts()

Ice Hockey Men's Ice Hockey                                   1001
Football Men's Football                                        783
Hockey Men's Hockey                                            714
Basketball Men's Basketball                                    610
Water Polo Men's Water Polo                                    573
                                                              ...
Diving Men's Plain High                                          1
Canoeing Men's Folding Kayak Singles, 10 kilometres              1
Art Competitions Mixed Architecture, Architectural Designs       1
Athletics Men's All-Around Championship                          1
Tennis Men's Singles, Covered Courts                             1
Name: Event, Length: 562, dtype: int64

In [162]:
df_athletes_men = df[(df.Gender == 'M')]
df_athletes_women = df[(df.Gender == 'F')]

print('Men athletes :', df_athletes_men.shape)
print('Women athletes:',df_athletes_women.shape)

Men athletes : (19831, 16)
Women athletes: (10350, 16)

In [99]:
df.groupby('Region')['Medal'].count().nlargest(20).reset_index()

            Region  Medal
0              USA   4383
1           Russia   3610
2          Germany   3189
3        Australia   1210
4           Canada   1060
5            Italy   1060
6               UK   1031
7            China    989
8           France    987
9            Japan    843
10         Hungary    791
11          Sweden    765
12         Finland    724
13     Netherlands    708
14         Romania    597
15     South Korea    561
16          Poland    548
17  Czech Republic    519
18          Norway    514
19          Serbia    467

In [100]:
pd.crosstab(df.Year,df.Medal,margins=True)

Medal  Bronze   Gold  Silver    All
Year
1896        3     11       6     20
1900        9     19      10     38
1904       12     34      13     59
1906       16     29      24     69
1908       37     54      43    134
1912       33     58      39    130
1920       37     78      67    182
1924       47     72      66    185
1928       51     67      52    170
1932       59     66      51    176
1936       56     87      50    193
1948       57     80      58    195
1952       93    124      85    302
1956      197    198     195    590
1960      321    338     317    976
1964      389    397     390   1176
1968      419    421     408   1248
1972      477    471     453   1401
1976      504    500     494   1498
1980      529    520     523   1572
1984      569    570     544   1683
1988      624    606     597   1827
1992      635    584     615   1834
1994      111    105     108    324
1996      593    563     561   1717
1998      149    144     144    437
2000      676    659     658   1993
2002      159    161     157    477
2004      676    664     660   2000
2006      175    176     175    526
2008      706    664     665   2035
2010      170    173     172    515
2012      669    622     624   1915
2014      190    190     190    570
2016      700    662     652   2014
All     10148  10167    9866  30181

In [101]:
participants=df.groupby('Year')['Name'].count().reset_index()
participants

    Year  Name
0   1896    20
1   1900    38
2   1904    59
3   1906    69
4   1908   134
5   1912   130
6   1920   182
7   1924   185
8   1928   170
9   1932   176
10  1936   193
11  1948   195
12  1952   302
13  1956   590
14  1960   976
15  1964  1176
16  1968  1248
17  1972  1401
18  1976  1498
19  1980  1572
20  1984  1683
21  1988  1827
22  1992  1834
23  1994   324
24  1996  1717
25  1998   437
26  2000  1993
27  2002   477
28  2004  2000
29  2006   526
30  2008  2035
31  2010   515
32  2012  1915
33  2014   570
34  2016  2014

In [102]:
df.groupby('Season')['Medal'].count().nlargest(20).reset_index()

   Season  Medal
0  Summer  25341
1  Winter   4840

In [103]:
type_of_medal=df.groupby(['Season','Medal']).size().reset_index()
type_of_medal

   Season   Medal     0
0  Summer  Bronze  8566
1  Summer    Gold  8542
2  Summer  Silver  8233
3  Winter  Bronze  1582
4  Winter    Gold  1625
5  Winter  Silver  1633

In [147]:
df_sum_athletes_men = df_athletes_men[(df_athletes_men.Season == 'Summer')]
df_w_athletes_men = df_athletes_men[(df_athletes_men.Season == 'Winter')]
df_sum_athletes_women = df_athletes_women[(df_athletes_women.Season == 'Summer')]
df_w_athletes_women = df_athletes_women[(df_athletes_women.Season == 'Winter')]

print('Summer Games athletesM   : ', df_sum_athletes_men.shape)
print('Winter Games athletesM  : ', df_w_athletes_men.shape)
print('Summer Games athletesW   : ', df_sum_athletes_women.shape)
print('Winter Games athletesW   : ', df_w_athletes_women.shape)

Summer Games athletesM   :  (16676, 16)
Winter Games athletesM  :  (3155, 16)
Summer Games athletesW   :  (8665, 16)
Winter Games athletesW   :  (1685, 16)

In [105]:
year_gender_medal=df.groupby(['Year', 'Gender'])['Medal'].count().reset_index()
year_gender_medal

    Year Gender  Medal
0   1896      M     20
1   1900      M     38
2   1904      M     59
3   1906      M     69
4   1908      M    134
..   ...    ...    ...
59  2012      M   1014
60  2014      F    250
61  2014      M    320
62  2016      F    967
63  2016      M   1047

[64 rows x 3 columns]

# Moteru atleciu statistika

In [218]:
df_athletes_women.describe()

                  ID           Age        Height        Weight          Year
count   10350.000000  10350.000000  10350.000000  10350.000000  10350.000000
mean    71594.987343     24.597585    170.532947     63.219614   1995.645024
std     39237.482011      5.097057      8.977389     10.681140     16.643975
min        37.000000     13.000000    136.000000     28.000000   1920.000000
25%     37777.000000     21.000000    165.000000     57.000000   1984.000000
50%     70711.000000     24.000000    170.000000     63.000000   2000.000000
75%    106938.000000     28.000000    176.000000     70.000000   2008.000000
max    135563.000000     52.000000    210.000000    167.000000   2016.000000

In [173]:
df_athletes_women['Age'].value_counts()

25.0    863
24.0    850
23.0    817
22.0    817
26.0    737
27.0    732
21.0    712
28.0    571
20.0    534
29.0    483
19.0    472
30.0    412
18.0    398
31.0    302
17.0    290
16.0    252
32.0    245
33.0    180
15.0    148
34.0    138
35.0     82
36.0     67
14.0     49
37.0     37
38.0     36
39.0     26
40.0     16
42.0     14
41.0     14
43.0     12
46.0     10
13.0      9
44.0      9
47.0      5
45.0      3
52.0      3
49.0      2
51.0      2
48.0      1
Name: Age, dtype: int64

In [171]:
df_athletes_women[df_athletes_women['Age']==25][['Name', 'Region']].drop_duplicates()

                                       Name    Region
747                       Elvan Abeylegesse    Turkey
1668    Adenzia Aparecida Ferreira da Silva    Brazil
1856           Adriana Aparecida dos Santos    Brazil
2936             Albina Khamitovna Akhatova    Russia
3048              Marina Dazmirovna Akobiya    Russia
...                                     ...       ...
269427                          Zhou Suhong     China
270155             Stanka Zlateva Khristova  Bulgaria
270208          Roswietha Zobelt (Reichel-)   Germany
270702               Erika Zuchold (Barth-)   Germany
271078  Galina Ivanovna Zybina (-Fyodorova)    Russia

[748 rows x 2 columns]

In [183]:
medals_by_age_women=df_athletes_women[df_athletes_women['Age']==25].groupby(['Medal']).size().reset_index()
medals_by_age_women

    Medal    0
0  Bronze  300
1    Gold  270
2  Silver  293

In [150]:
df_athletes_women['Age'].max()

52.0

In [151]:
df_athletes_women[df_athletes_women['Age'] == 52].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
53710,27549,Patricia Dench,F,52.0,163.0,65.0,Australia,AUS,1984 Summer,1984,Summer,Los Angeles,Shooting,"Shooting Women's Sporting Pistol, 25 metres",Bronze,Australia
145817,73175,"Elizabeth ""Beezie"" Madden (Patton-)",F,52.0,168.0,63.0,United States,USA,2016 Summer,2016,Summer,Rio de Janeiro,Equestrianism,"Equestrianism Mixed Jumping, Team",Silver,USA
239332,119965,Lesley Allison Thompson-Willie,F,52.0,160.0,50.0,Canada,CAN,2012 Summer,2012,Summer,London,Rowing,Rowing Women's Coxed Eights,Silver,Canada

In [126]:
df_athletes_women['Age'].min()

13.0

In [127]:
df_athletes_women[df_athletes_women['Age'] == 13].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
44972,23192,Robin Marie Corsiglia (-Scholefield),F,13.0,157.0,45.0,Canada,CAN,1976 Summer,1976,Summer,Montreal,Swimming,Swimming Women's 4 x 100 metres Medley Relay,Bronze,Canada
52010,26731,Donna Elizabeth de Varona (-Pinto),F,13.0,168.0,61.0,United States,USA,1960 Summer,1960,Summer,Roma,Swimming,Swimming Women's 4 x 100 metres Freestyle Relay,Gold,USA
63524,32552,"Kornelia Ender (-Matthes, -Grummt)",F,13.0,172.0,59.0,East Germany,GDR,1972 Summer,1972,Summer,Munich,Swimming,Swimming Women's 4 x 100 metres Freestyle Relay,Silver,Germany
63525,32552,"Kornelia Ender (-Matthes, -Grummt)",F,13.0,172.0,59.0,East Germany,GDR,1972 Summer,1972,Summer,Munich,Swimming,Swimming Women's 200 metres Individual Medley,Silver,Germany
63526,32552,"Kornelia Ender (-Matthes, -Grummt)",F,13.0,172.0,59.0,East Germany,GDR,1972 Summer,1972,Summer,Munich,Swimming,Swimming Women's 4 x 100 metres Medley Relay,Silver,Germany

In [128]:
df_athletes_women['Height'].value_counts()

170.0    800
168.0    639
165.0    573
175.0    551
173.0    542
        ...
210.0      2
137.0      2
197.0      2
205.0      1
138.0      1
Name: Height, Length: 70, dtype: int64

In [184]:
df_athletes_women[df_athletes_women['Height']==170][['Name', 'Region']].drop_duplicates()

                                        Name   Region
1863        Adriana "Adrianinha" Moiss Pinto   Brazil
2263                    Macarena Aguilar Daz    Spain
4273        Joan "Jody" Alderson (-Braskamp)      USA
4524          Buffy-Lynne Alexander-Williams   Canada
4600             Lidiya Nikolayevna Alfeyeva   Russia
...                                      ...      ...
268538                             Zeng Zhen    China
268965                        Zhang Xiaohuan    China
269101                              Zhao Kun    China
269321  Marina Serafimovna Zhirova (Titova-)   Russia
269855                  Annemarie Zimmermann  Germany

[556 rows x 2 columns]

In [185]:
medals_by_height_women=df_athletes_women[df_athletes_women['Height']==170].groupby(['Medal']).size().reset_index()
medals_by_height_women

    Medal    0
0  Bronze  286
1    Gold  244
2  Silver  270

In [129]:
df_athletes_women['Height'].max()

210.0

In [130]:
df_athletes_women[df_athletes_women['Height'] == 210.0].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
216267,108551,Ujana Semjonova,F,24.0,210.0,128.0,Soviet Union,URS,1976 Summer,1976,Summer,Montreal,Basketball,Basketball Women's Basketball,Gold,Russia
216268,108551,Ujana Semjonova,F,28.0,210.0,128.0,Soviet Union,URS,1980 Summer,1980,Summer,Moskva,Basketball,Basketball Women's Basketball,Gold,Russia

In [131]:
df_athletes_women['Height'].min()

136.0

In [132]:
df_athletes_women[df_athletes_women['Height'] == 136.0].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
69216,35292,Mariya Yevgenyevna Filatova (-Kurbatova),F,14.0,136.0,30.0,Soviet Union,URS,1976 Summer,1976,Summer,Montreal,Gymnastics,Gymnastics Women's Team All-Around,Gold,Russia
69222,35292,Mariya Yevgenyevna Filatova (-Kurbatova),F,19.0,136.0,30.0,Soviet Union,URS,1980 Summer,1980,Summer,Moskva,Gymnastics,Gymnastics Women's Team All-Around,Gold,Russia
69225,35292,Mariya Yevgenyevna Filatova (-Kurbatova),F,19.0,136.0,30.0,Soviet Union,URS,1980 Summer,1980,Summer,Moskva,Gymnastics,Gymnastics Women's Uneven Bars,Bronze,Russia
143279,71914,Lu Li,F,15.0,136.0,30.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Gymnastics,Gymnastics Women's Uneven Bars,Gold,China
143280,71914,Lu Li,F,15.0,136.0,30.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Gymnastics,Gymnastics Women's Balance Beam,Silver,China

In [133]:
df_athletes_women['Weight'].value_counts()

60.0     544
63.0     520
58.0     465
70.0     445
64.0     442
        ...
114.0      1
110.0      1
113.0      1
97.0       1
133.0      1
Name: Weight, Length: 111, dtype: int64

In [188]:
df_athletes_women[df_athletes_women['Weight']==60][['Name', 'Region']].drop_duplicates()

                                        Name     Region
195                Tamila Rashidovna Abasova     Russia
971               Nelli Mikhaylovna Abramova     Russia
2618        Mara Magdalena Aicega Amicarelli  Argentina
5148                         Carmela Allucci      Italy
5457                              Ida Alstad     Norway
...                                      ...        ...
269242                         Zheng Dongmei      China
269443                              Zhou Yan      China
269825                        Laima Zilporyt     Russia
270976  Nataliya Maratovna "Natasha" Zvereva     Russia
271009                           Julia Zwehl    Germany

[371 rows x 2 columns]

In [187]:
medals_by_weight_women=df_athletes_women[df_athletes_women['Weight']==60].groupby(['Medal']).size().reset_index()
medals_by_weight_women

    Medal    0
0  Bronze  173
1    Gold  169
2  Silver  202

In [134]:
df_athletes_women['Weight'].max()

167.0

In [135]:
df_athletes_women[df_athletes_women['Weight'] == 167.0].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
124420,62843,Olha Vasylivna Korobka,F,22.0,181.0,167.0,Ukraine,UKR,2008 Summer,2008,Summer,Beijing,Weightlifting,Weightlifting Women's Super-Heavyweight,Silver,Ukraine

In [136]:
df_athletes_women['Weight'].min()

28.0

In [137]:
df_athletes_women[df_athletes_women['Weight'] == 28.0].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
256836,128605,Wang Xin (Ruoxue-),F,15.0,137.0,28.0,China,CHN,2008 Summer,2008,Summer,Beijing,Diving,Diving Women's Platform,Bronze,China
256837,128605,Wang Xin (Ruoxue-),F,15.0,137.0,28.0,China,CHN,2008 Summer,2008,Summer,Beijing,Diving,Diving Women's Synchronized Platform,Gold,China

In [ ]:
# Suvedus i viena fiziniu duomenu rezultatus
# Moteru atleciu amzius:25, Ugis:170, Svoris: 60

In [228]:
df_athletes_women[(df_athletes_women['Age']==25)&(df_athletes_women['Height']==170)&(df_athletes_women['Weight']==60)][['Name', 'Region']].drop_duplicates()

                                                 Name       Region
31477                         Valeria Bufanu-tefnescu      Romania
158953                        Jearl Atawa Miles-Clark          USA
174992                      Sofya Albertovna Ochigava       Russia
199699                    Manon Ann Rhaume (-St. Cyr)       Canada
242941  Marina Yevgenyevna Trandenkova (Krivosheina-)       Russia
249224                               Aletta van Manen  Netherlands

In [250]:
age_by_sport_women=df_athletes_women.groupby(['Age','Sport','Team']).size().reset_index()
age_by_sport_women

       Age                      Sport           Team  0
0     13.0                     Diving          China  1
1     13.0                 Gymnastics        Romania  1
2     13.0  Short Track Speed Skating    South Korea  1
3     13.0                   Swimming         Canada  1
4     13.0                   Swimming          China  1
...    ...                        ...            ... ..
4321  51.0              Equestrianism         Canada  1
4322  51.0              Equestrianism  Great Britain  1
4323  52.0              Equestrianism  United States  1
4324  52.0                     Rowing         Canada  1
4325  52.0                   Shooting      Australia  1

[4326 rows x 4 columns]

# Vyru atletu statistika

In [32]:
df_athletes_men.describe()

                  ID           Age        Height        Weight          Year
count   19831.000000  19831.000000  19831.000000  19831.000000  19831.000000
mean    69511.434925     25.862942    181.352831     79.251324   1984.019061
std     38612.218475      4.969973      9.970714     13.963534     24.384139
min        16.000000     13.000000    140.000000     41.000000   1896.000000
25%     37301.000000     22.000000    175.000000     70.000000   1972.000000
50%     69248.000000     25.000000    181.000000     78.000000   1988.000000
75%    103122.000000     28.000000    188.000000     87.000000   2004.000000
max    135554.000000     66.000000    223.000000    182.000000   2016.000000

In [34]:
df_athletes_men['Age'].value_counts()

23.0    1925
24.0    1799
22.0    1732
25.0    1695
26.0    1641
27.0    1481
21.0    1428
28.0    1377
29.0    1070
20.0    1016
30.0     844
31.0     648
19.0     553
32.0     515
33.0     378
34.0     315
18.0     246
35.0     213
36.0     174
37.0     123
17.0     109
38.0      86
40.0      74
39.0      68
41.0      44
42.0      41
16.0      32
46.0      31
44.0      28
45.0      23
43.0      21
52.0      15
49.0      13
48.0      13
47.0      10
50.0       9
15.0       7
54.0       5
56.0       5
14.0       4
60.0       3
51.0       3
55.0       3
58.0       3
61.0       2
53.0       2
59.0       1
66.0       1
57.0       1
13.0       1
Name: Age, dtype: int64

In [190]:
df_athletes_men[df_athletes_men['Age']==23][['Name', 'Region']].drop_duplicates()

                                   Name       Region
173                           Luc Abalo       France
525               Muhammad Abdul Rashid     Pakistan
609          Julius Shareef Abdur-Rahim          USA
672                  Clarence John Abel          USA
1029    Alejandro "lex" Abrines Redondo        Spain
...                                 ...          ...
270732         Martijn Hendrik Zuijdweg  Netherlands
270759            Claudio F. Zulianello    Argentina
270781       Jaime Zumalacrregui Bentez        Spain
270981                  Zurab Zviadauri      Georgia
271013  Klaas Erik "Klaas-Erik" Zwering  Netherlands

[1718 rows x 2 columns]

In [191]:
medals_by_age_men=df_athletes_men[df_athletes_men['Age']==23].groupby(['Medal']).size().reset_index()
medals_by_age_men

    Medal    0
0  Bronze  648
1    Gold  653
2  Silver  624

In [35]:
df_athletes_men['Age'].max()

66.0

In [37]:
df_athletes_men[df_athletes_men['Age'] == 66].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
173379,87135,Louis Noverraz,M,66.0,179.0,78.0,Switzerland,SUI,1968 Summer,1968,Summer,Mexico City,Sailing,Sailing Mixed 5.5 metres,Silver,Switzerland

In [38]:
df_athletes_men['Age'].min()

13.0

In [39]:
df_athletes_men[df_athletes_men['Age'] == 13].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
268602,134381,Klaus Zerta,M,13.0,165.0,48.0,Germany,GER,1960 Summer,1960,Summer,Roma,Rowing,Rowing Men's Coxed Pairs,Gold,Germany

In [40]:
df_athletes_men['Height'].value_counts()

180.0    1304
183.0    1195
178.0    1123
185.0    1023
175.0     828
         ...
148.0       1
142.0       1
140.0       1
143.0       1
144.0       1
Name: Height, Length: 80, dtype: int64

In [192]:
df_athletes_men[df_athletes_men['Height']==180][['Name', 'Region']].drop_duplicates()

                                    Name          Region
172     Aleksey Aleksandrovich Abalmasov         Belarus
1044                      Julien Absalon          France
1579                          Simon Addo           Ghana
1712                      Franck Adisson          France
1733                        Daniel Adler          Brazil
...                                  ...             ...
269345   Vladimir Vladimirovich Zhmudsky          Russia
269630                      Marek idlick  Czech Republic
269861                   Egon Zimmermann         Austria
270114                      Zoran ivkovi          Serbia
270340                        Peter onta        Slovenia

[947 rows x 2 columns]

In [197]:
medals_by_height_men=df_athletes_men[df_athletes_men['Height']==180].groupby(['Medal']).size().reset_index()
medals_by_height_men

    Medal    0
0  Bronze  472
1    Gold  418
2  Silver  414

In [41]:
df_athletes_men['Height'].max()

223.0

In [42]:
df_athletes_men[df_athletes_men['Height'] == 223].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
32376,16639,Tommy Loren Burleson,M,20.0,223.0,102.0,United States,USA,1972 Summer,1972,Summer,Munich,Basketball,Basketball Men's Basketball,Silver,USA
207373,104059,Arvydas Romas Sabonis,M,23.0,223.0,122.0,Soviet Union,URS,1988 Summer,1988,Summer,Seoul,Basketball,Basketball Men's Basketball,Gold,Russia
207374,104059,Arvydas Romas Sabonis,M,27.0,223.0,122.0,Lithuania,LTU,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,Bronze,Lithuania
207375,104059,Arvydas Romas Sabonis,M,31.0,223.0,122.0,Lithuania,LTU,1996 Summer,1996,Summer,Atlanta,Basketball,Basketball Men's Basketball,Bronze,Lithuania

In [43]:
df_athletes_men['Height'].min()

140.0

In [44]:
df_athletes_men[df_athletes_men['Height'] == 140].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
53943,27672,"Joseph Nicholas ""Joe"" DePietro",M,34.0,140.0,56.0,United States,USA,1948 Summer,1948,Summer,London,Weightlifting,Weightlifting Men's Bantamweight,Gold,USA

In [45]:
df_athletes_men['Weight'].value_counts()

75.0     907
70.0     809
80.0     803
73.0     680
78.0     636
        ...
100.5      1
138.0      1
108.5      1
102.5      1
121.0      1
Name: Weight, Length: 163, dtype: int64

In [198]:
df_athletes_men[df_athletes_men['Weight']==75][['Name', 'Region']].drop_duplicates()

                                   Name        Region
915             Harold Maurice Abrahams            UK
1192                   Alfred Achermann   Switzerland
1977             Cecil Sebastian Afrika  South Africa
2138    Benjamin Alexandro "Ben" Agosto           USA
2493                      Manzoor Ahmed      Pakistan
...                                 ...           ...
269845                Wolfgang Zimmerer       Germany
270143               Asen Ivanov Zlatev      Bulgaria
270162                    Andrija Zlati        Serbia
270412                   Cristian Zorzi         Italy
270579                      Ryszard Zub        Poland

[633 rows x 2 columns]

In [196]:
medals_by_weight_men=df_athletes_men[df_athletes_men['Weight']==75].groupby(['Medal']).size().reset_index()
medals_by_weight_men

    Medal    0
0  Bronze  306
1    Gold  297
2  Silver  304

In [46]:
df_athletes_men['Weight'].max()

182.0

In [47]:
df_athletes_men[df_athletes_men['Weight'] == 182].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
237040,118869,"Christopher J. ""Chris"" Taylor",M,22.0,196.0,182.0,United States,USA,1972 Summer,1972,Summer,Munich,Wrestling,"Wrestling Men's Super-Heavyweight, Freestyle",Bronze,USA

In [48]:
df_athletes_men['Weight'].min()

41.0

In [49]:
df_athletes_men[df_athletes_men['Weight'] == 41].head()

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
48127,24814,Barry Edward Dagger,M,47.0,147.0,41.0,Great Britain,GBR,1984 Summer,1984,Summer,Los Angeles,Shooting,"Shooting Men's Air Rifle, 10 metres",Bronze,UK

In [ ]:
# Suvedus i viena fiziniu duomenu rezultatus
# Vyru atletu amzius:23, Ugis:180, Svoris: 75

In [227]:
df_athletes_men[(df_athletes_men['Age']==23)&(df_athletes_men['Height']==180)&(df_athletes_men['Weight']==75)][['Name', 'Region']].drop_duplicates()

                                Name      Region
15139   Michael Ray "Mike" Barrowman         USA
86285             Jonathan Guilmette      Canada
146307            Jean-Claude Magnan      France
182765      Aleksandr "Alex" Parygin  Kazakhstan
187717             Stefan Pfannmller     Germany
193180   Gennady Sergeyevich Prigoda      Russia
207852               Kamran ahsuvarl  Azerbaijan
220763         George Sidney Simpson         USA
226015        Helmuth Nyborg Srensen     Denmark
242995                    Livio Trap       Italy
244415               Naoki Tsukahara       Japan
247505            Maigonis Valdmanis      Russia
251289                 Erik K. Vendt         USA

In [249]:
age_by_sport_men=df_athletes_men.groupby(['Age','Sport','Team']).size().reset_index()
age_by_sport_men

       Age           Sport           Team  0
0     13.0          Rowing        Germany  1
1     14.0          Diving          China  1
2     14.0  Figure Skating  United States  1
3     14.0          Rowing   West Germany  1
4     14.0          Rowing     Yugoslavia  1
...    ...             ...            ... ..
7402  60.0   Equestrianism   West Germany  2
7403  60.0         Sailing       Rush VII  1
7404  61.0   Equestrianism      Australia  1
7405  61.0   Equestrianism         Canada  1
7406  66.0         Sailing    Switzerland  1

[7407 rows x 4 columns]

# LT Olimpines komandos analize

In [271]:
LT_athletes = df[(df.Team == 'Lithuania')]

In [272]:
LT_athletes.sample(5)

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
110786,56035,Sergjus Jovaia,M,37.0,195.0,85.0,Lithuania,LTU,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,Bronze,Lithuania
207374,104059,Arvydas Romas Sabonis,M,27.0,223.0,122.0,Lithuania,LTU,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,Bronze,Lithuania
253294,126840,Arnas Romas Visockas,M,26.0,199.0,108.0,Lithuania,LTU,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,Bronze,Lithuania
149215,74847,Kstutis Mariulionis,M,24.0,188.0,74.0,Lithuania,LTU,2000 Summer,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,Bronze,Lithuania
269815,134996,Diana ilit,F,24.0,162.0,61.0,Lithuania,LTU,2000 Summer,2000,Summer,Sydney,Cycling,"Cycling Women's Road Race, Individual",Bronze,Lithuania

In [275]:
LT_athletes.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 1807 to 270743
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      61 non-null     int64
 1   Name    61 non-null     object
 2   Gender  61 non-null     object
 3   Age     61 non-null     float64
 4   Height  61 non-null     float64
 5   Weight  61 non-null     float64
 6   Team    61 non-null     object
 7   NOC     61 non-null     object
 8   Games   61 non-null     object
 9   Year    61 non-null     int64
 10  Season  61 non-null     object
 11  City    61 non-null     object
 12  Sport   61 non-null     object
 13  Event   61 non-null     object
 14  Medal   61 non-null     object
 15  Region  61 non-null     object
dtypes: float64(3), int64(2), object(11)
memory usage: 8.1+ KB

In [278]:
LT_athletes['ID'][LtTeam['Age']<18].count() # Jaunesni nei 18 metu

1

In [279]:
LT_athletes['ID'][LtTeam['Age'] > 36].count()# Vyresni nei 36 metu

1

In [298]:
LT_athletes.Region.value_counts().reset_index(name='Medal').head()

       index  Medal
0  Lithuania     61

In [292]:
LT_athletes.groupby('Gender')['Medal'].count().nlargest(20).reset_index()

  Gender  Medal
0      M     51
1      F     10

In [282]:
LT_athletes = df[(df.Region == 'Lithuania')].sort_values('Medal')

In [283]:
LT_athletes

,ID,Name,Gender,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,Region
1807,1000,Dainius Adomaitis,M,26.0,202.0,100.0,Lithuania,LTU,2000 Summer,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,Bronze,Lithuania
151669,76115,Tomas Masiulis,M,24.0,205.0,104.0,Lithuania,LTU,2000 Summer,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,Bronze,Lithuania
270741,135401,Eurelijus ukauskas,M,27.0,218.0,115.0,Lithuania,LTU,2000 Summer,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,Bronze,Lithuania
160684,80631,Mindaugas Mizgaitis,M,28.0,190.0,120.0,Lithuania,LTU,2008 Summer,2008,Summer,Beijing,Wrestling,"Wrestling Men's Super-Heavyweight, Greco-Roman",Bronze,Lithuania
179873,90401,Tomas Pasas,M,24.0,188.0,81.0,Lithuania,LTU,1996 Summer,1996,Summer,Atlanta,Basketball,Basketball Men's Basketball,Bronze,Lithuania
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
127707,64378,Edvinas Krungolcas,M,35.0,187.0,79.0,Lithuania,LTU,2008 Summer,2008,Summer,Beijing,Modern Pentathlon,Modern Pentathlon Men's Individual,Silver,Lithuania
231847,116307,Jevgenijus uklinas,M,26.0,196.0,109.0,Lithuania,LTU,2012 Summer,2012,Summer,London,Canoeing,"Canoeing Men's Canadian Singles, 200 metres",Silver,Lithuania
84812,43037,Mindaugas Grikonis,M,30.0,190.0,92.0,Lithuania,LTU,2016 Summer,2016,Summer,Rio de Janeiro,Rowing,Rowing Men's Double Sculls,Silver,Lithuania
201228,101070,Saulius Ritter,M,27.0,202.0,110.0,Lithuania,LTU,2016 Summer,2016,Summer,Rio de Janeiro,Rowing,Rowing Men's Double Sculls,Silver,Lithuania
222596,111829,Austra Skujyt,F,24.0,188.0,82.0,Lithuania,LTU,2004 Summer,2004,Summer,Athina,Athletics,Athletics Women's Heptathlon,Silver,Lithuania

In [284]:
LT_Men = LT_athletes[(LT_athletes.Gender == 'M')]

In [286]:
LT_Men.describe()

                  ID        Age      Height      Weight         Year
count      51.000000  51.000000   51.000000   51.000000    51.000000
mean    75334.764706  27.294118  196.666667   99.254902  2000.156863
std     40256.403313   4.392239   12.012771   16.408343     7.754670
min      1000.000000  20.000000  164.000000   60.000000  1992.000000
25%     48516.000000  24.000000  192.500000   92.000000  1994.000000
50%     74848.000000  27.000000  197.000000   95.000000  2000.000000
75%    112290.000000  30.000000  203.500000  110.000000  2004.000000
max    135402.000000  37.000000  223.000000  130.000000  2016.000000

In [307]:
LT_Men['Age'].value_counts()

26.0    7
24.0    6
28.0    5
22.0    5
27.0    4
20.0    4
30.0    4
32.0    4
31.0    2
25.0    2
33.0    2
29.0    2
36.0    2
37.0    1
35.0    1
Name: Age, dtype: int64

In [287]:
LT_Women = LT_athletes[(LT_athletes.Gender == 'F')]

In [290]:
LT_Women.describe()

                  ID        Age     Height     Weight         Year
count      10.000000  10.000000   10.00000  10.000000    10.000000
mean    95276.100000  25.900000  175.20000  69.100000  2006.800000
std     41915.126282   5.258855    9.48449  10.524574     6.811755
min      5453.000000  15.000000  160.00000  49.000000  2000.000000
25%     82743.500000  24.000000  170.50000  62.250000  2000.000000
50%    108187.500000  26.000000  176.00000  70.500000  2006.000000
75%    126114.250000  28.750000  182.50000  76.750000  2012.000000
max    134996.000000  34.000000  188.00000  82.000000  2016.000000

In [306]:
LT_Women['Age'].value_counts()

24.0    2
29.0    1
31.0    1
22.0    1
27.0    1
34.0    1
28.0    1
15.0    1
25.0    1
Name: Age, dtype: int64

In [299]:
LT_Team_gold = LT_athletes[(LT_athletes.Medal == 'Gold')]

In [300]:
LT_Team_gold.Event.value_counts().reset_index(name='Medal').head()

                                      index  Medal
0              Athletics Men's Discus Throw      3
1                     Shooting Women's Trap      1
2      Modern Pentathlon Women's Individual      1
3  Swimming Women's 100 metres Breaststroke      1

In [315]:
all_LT_medals=LT_athletes.groupby(['Name', 'Medal','Sport']).size().reset_index()
all_LT_medals

                                 Name   Medal              Sport  0
0             Aleksandras Kazakeviius  Bronze          Wrestling  1
1                  Alvydas Pazdrazdis  Bronze         Basketball  1
2              Andrejus Zadneprovskis  Bronze  Modern Pentathlon  1
3              Andrejus Zadneprovskis  Silver  Modern Pentathlon  1
4                  Andrius Giedraitis  Bronze         Basketball  1
5                Arnas Romas Visockas  Bronze         Basketball  1
6                    Artras Karniovas  Bronze         Basketball  2
7               Arvydas Romas Sabonis  Bronze         Basketball  2
8                    Aurimas Didbalis  Bronze      Weightlifting  1
9                      Aurimas Lankas  Bronze           Canoeing  1
10                      Austra Skujyt  Silver          Athletics  1
11         Birut akickien (Juoznait-)  Bronze             Rowing  1
12                  Daina Gudzineviit    Gold           Shooting  1
13                  Dainius Adomaitis  Bronze         Basketball  1
14                   Darius Dimaviius  Bronze         Basketball  1
15                    Darius Lukminas  Bronze         Basketball  1
16                  Darius Maskolinas  Bronze         Basketball  1
17                    Darius Songaila  Bronze         Basketball  1
18                         Diana ilit  Bronze            Cycling  1
19                   Donata Vitartait  Bronze             Rowing  1
20                 Edvinas Krungolcas  Silver  Modern Pentathlon  1
21                Edvinas Ramanauskas  Bronze           Canoeing  1
22                 Eurelijus ukauskas  Bronze         Basketball  2
23                 Evaldas Petrauskas  Bronze             Boxing  1
24         Gintar Volungeviit-Scheidt  Silver            Sailing  1
25                   Gintaras Einikis  Bronze         Basketball  3
26                  Gintaras Krapikas  Bronze         Basketball  1
27                 Jevgenijus uklinas  Silver           Canoeing  1
28  Kristina Poplavskaja (-Bagvilien)  Bronze             Rowing  1
29                Kstutis Mariulionis  Bronze         Basketball  1
30   Laura Asadauskait-Zadneprovskien    Gold  Modern Pentathlon  1
31                    Milda Valiukait  Bronze             Rowing  1
32                 Mindaugas Grikonis  Silver             Rowing  1
33                Mindaugas Mizgaitis  Bronze          Wrestling  1
34                Mindaugas Timinskas  Bronze         Basketball  1
35                 Mindaugas ukauskas  Bronze         Basketball  1
36        Raimondas arnas Mariulionis  Bronze         Basketball  2
37                    Ramnas ikauskas  Bronze         Basketball  1
38                  Rimas Kurtinaitis  Bronze         Basketball  2
39                Romanas Brazdauskis  Bronze         Basketball  1
40                      Romas Ubartas    Gold          Athletics  1
41                       Rta Meilutyt    Gold           Swimming  1
42                      Rytis Vaivila  Bronze         Basketball  1
43                     Saulius Ritter  Silver             Rowing  1
44                  Saulius tombergas  Bronze         Basketball  2
45                     Sergjus Jovaia  Bronze         Basketball  1
46                     Tomas Masiulis  Bronze         Basketball  1
47                        Tomas Pasas  Bronze         Basketball  1
48                Valdemaras Chomiius  Bronze         Basketball  1
49                  Virgilijus Alekna  Bronze          Athletics  1
50                  Virgilijus Alekna    Gold          Athletics  2
51                  arnas Jasikeviius  Bronze         Basketball  1

In [316]:
all_LT_medals.groupby('Sport')['Medal'].count().nlargest(20).reset_index()

                Sport  Medal
0          Basketball     27
1              Rowing      6
2           Athletics      4
3   Modern Pentathlon      4
4            Canoeing      3
5           Wrestling      2
6              Boxing      1
7             Cycling      1
8             Sailing      1
9            Shooting      1
10           Swimming      1
11      Weightlifting      1